In [14]:
### Library Imports
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

### Script Imports
import utils

### Import the trans file
na_values= ['None', '?',]
df = pd.read_csv('../../project/banking_data/trans_train.csv', sep=';',na_values=na_values)

C:\Users\Hugo\Anaconda3\lib\site-packages\IPython\core\interactiveshell.py:2785: DtypeWarning: Columns (8) have mixed types.Specify dtype option on import or set low_memory=False.
  interactivity=interactivity, compiler=compiler, result=result)

In [15]:
### Convert date format
trans = utils.date_conversion(df,'date')

In [16]:
### Drop columns with too many missing values
trans = utils.drop_null_columns(trans,0.4)

In [17]:
### Replace null values from the operation column for the most common occurence
trans['operation'] = trans['operation'].fillna(trans['operation'].value_counts().idxmax())

In [19]:
lower_bound = trans['balance'].quantile(.10)
upper_bound = trans['balance'].quantile(.90)

print(trans.size)

trans = trans[(trans['balance'] > lower_bound) & (trans['balance'] < upper_bound)]

# print(df[df['balance'] < upper_bound])
print(trans.size)

trans

2221415
1777118

,trans_id,account_id,date,type,operation,amount,balance
1,1548750,5270,14-01-1993,credit,collection from another bank,44749.0,45549.0
8,1910790,6473,26-01-1993,credit,credit in cash,19961.0,21061.0
10,3453599,6473,31-01-1993,credit,withdrawal in cash,17.0,21078.0
12,3669814,5270,31-01-1993,credit,withdrawal in cash,110.2,45659.2
24,2349709,7753,12-02-1993,credit,credit in cash,19588.0,20188.0
...,...,...,...,...,...,...,...
396670,488649,1666,31-12-1996,withdrawal,withdrawal in cash,14.6,43529.3
396673,488124,1664,31-12-1996,withdrawal,withdrawal in cash,14.6,24246.7
396676,515947,1763,31-12-1996,withdrawal,withdrawal in cash,20300.0,47469.5
396679,518662,1771,31-12-1996,withdrawal,withdrawal in cash,14.6,37894.9
396683,517894,1769,31-12-1996,withdrawal,withdrawal in cash,14.6,34679.4